pip install sqlalchemy
pip install lxml
pip install html5lib
pip install BeautifulSoup4

In [1]:
import pandas as pd

In [2]:
pwd

'C:\\Users\\Adhikansh\\Desktop\\Machine Learning'

In [7]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
df = pd.read_csv('example')

In [9]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
df.to_csv('My_output')

In [13]:
pd.read_csv('My_output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [14]:
df.to_csv('My_output',index = False)

In [15]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [18]:
pd.read_excel('Excel_Sample.xlsx',sheet_name = 'Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [19]:
df.to_excel('Excel_Sample.xlsx',sheet_name='NewSheet')

In [ ]:
 data =